Core/src/InformationRegisters/УчетныеЗаписиПользователя/УчетныеЗаписиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетныеЗаписиПользователя</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ОшибкиПодключенияЭлектроннойПочтыУНФ/ОшибкиПодключенияЭлектроннойПочтыУНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиПодключенияЭлектроннойПочтыУНФ</name>
  <resources>
    <name>ПодробноеПредставлениеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОшибки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/СеансовыеДанныеGoogle/СеансовыеДанныеGoogle.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СеансовыеДанныеGoogle</name>
  <resources>
    <name>access_token</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>token_type</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>refresh_token</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>disabled</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьДоступа</name>
    <type>
      <types>EnumRef.ОбластиДоступаGoogle</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗаписьЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ОбластиДоступаGoogle/ОбластиДоступаGoogle.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбластиДоступаGoogle</name>
  <enumValues>
    <name>Профиль</name>
  </enumValues>
  <enumValues>
    <name>Календарь</name>
  </enumValues>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Контакты</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>SMTPАутентификация</name>
    <type>
      <types>EnumRef.ВариантыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособPOP3Аутентификации</name>
    <type>
      <types>EnumRef.СпособыPOP3Аутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособSMTPАутентификации</name>
    <type>
      <types>EnumRef.СпособыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВПредставлениеВключатьИмяПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственныйЗаОбработкуПисем</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/InformationRegisters/УчетныеЗаписиПользователя/Forms/НастройкаУчетныхЗаписейПользователя/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокУчетныхЗаписей();
	
	НастроитьВидимостьПодключитьПочтовуюСлужбу();
	
	КлючСохраненияПоложенияОкна = Заголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияУчетнаяЗаписьОбновлена() Тогда
		ОбработатьПодключениеПочтовойСлужбыНаСервере(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УчетныеЗаписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.Комментарий Тогда
		ОткрытьФорму("РегистрСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ.ФормаСписка",
		Новый Структура("УчетнаяЗапись", Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись));
	Иначе
		ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта",
		Новый Структура("Ключ", Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись),
		ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьПочтуПриИзменении(Элемент)
	
	Если Элементы.УчетныеЗаписи.ТекущиеДанные.ЗагружатьПочту
		И Элементы.УчетныеЗаписи.ТекущиеДанные.ЭтоУчетнаяЗаписьGoogle
		И ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(Элементы.УчетныеЗаписи.ТекущиеДанные.СеансовыеДанные) Тогда
		НачатьАвторизацию();
		Возврат;
	КонецЕсли;
	
	УстановитьПризнакЗагружатьПочту(
	Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись,
	Элементы.УчетныеЗаписи.ТекущиеДанные.ЗагружатьПочту);
	
	Элементы.УчетныеЗаписи.ТекущиеДанные.Комментарий = "";
	
	Оповестить(ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияИзмененСоставПодключенныхУчетныхЗаписей(),,
	ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяДляОтправкиПочтыПриИзменении(Элемент)
	
	Если Не Элементы.УчетныеЗаписи.ТекущиеДанные.ОсновнаяДляОтправкиПочты Тогда
		УстановитьОсновнуюУчетнуюЗапись(ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка"));
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из УчетныеЗаписи Цикл
		Если ТекСтрока.УчетнаяЗапись <> Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись Тогда
			ТекСтрока.ОсновнаяДляОтправкиПочты = Не Элементы.УчетныеЗаписи.ТекущиеДанные.ОсновнаяДляОтправкиПочты
		КонецЕсли;
	КонецЦикла;
	
	УстановитьОсновнуюУчетнуюЗапись(Элементы.УчетныеЗаписи.ТекущиеДанные.УчетнаяЗапись);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУчетнуюЗаписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "IMAP" Тогда
		ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта");
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Gmail" Тогда
		НачатьАвторизацию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокУчетныхЗаписей()
	
	УчетныеЗаписи.Загрузить(
	РегистрыСведений.УчетныеЗаписиПользователя.НастройкаПользователя(
	Пользователи.ТекущийПользователь()));
	
	УчетнаяЗаписьДляОтправкиПочты = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяУчетнаяЗаписьЭлектроннойПочты");
	
	Для Каждого ТекУчетнаяЗапись Из УчетныеЗаписи Цикл
		
		ТекУчетнаяЗапись.ЭтоУчетнаяЗаписьGoogle = ОбменСGoogle.ЭтоУчетнаяЗаписьGoogle(ТекУчетнаяЗапись.УчетнаяЗапись);
		Если ТекУчетнаяЗапись.ЭтоУчетнаяЗаписьGoogle Тогда
			ТекУчетнаяЗапись.СеансовыеДанные = РегистрыСведений.СеансовыеДанныеGoogle.СеансовыеДанные(
			Пользователи.ТекущийПользователь(),
			Перечисления.ОбластиДоступаGoogle.Почта,
			ТекУчетнаяЗапись.УчетнаяЗапись);
		КонецЕсли;
		
		Если ТекУчетнаяЗапись.УчетнаяЗапись = УчетнаяЗаписьДляОтправкиПочты Тогда
			ТекУчетнаяЗапись.ОсновнаяДляОтправкиПочты = Истина;
		КонецЕсли;
		
		ОтобразитьКомментарий(ТекУчетнаяЗапись)
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(УчетныеЗаписи) Тогда
		Элементы.УчетныеЗаписи.Видимость = Истина;
		Заголовок = НСтр("ka='ჩემი სააღრიცხვო ჩანაწერები';ru='Мои учетные записи';en='My accounts'");
	Иначе
		Элементы.УчетныеЗаписи.Видимость = Ложь;
		Заголовок = НСтр("ka='სააღრიცხვო ჩანაწერები არ არის შეერთებული';ru='Учетные записи не подключены';en='Accounts are not connected'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКомментарий(ТекУчетнаяЗапись)
	
	КоличествоОшибокПодключения = РегистрыСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ.КоличествоОшибокПодключения(ТекУчетнаяЗапись.УчетнаяЗапись);
	Если Не ЗначениеЗаполнено(КоличествоОшибокПодключения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекУчетнаяЗапись.ЗагружатьПочту Тогда
		ТекУчетнаяЗапись.Комментарий = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
		КоличествоОшибокПодключения,
		НСтр("ka='ошибка подключения,ошибки  подключения,ошибок подключения';ru='ошибка подключения,ошибки  подключения,ошибок подключения';en='connection error connection error connection error'"));
	Иначе
		ТекУчетнаяЗапись.Комментарий = НСтр("ka='Отключена из-за множественных ошибок';ru='Отключена из-за множественных ошибок';en='Disabled due to multiple errors'");
	КонецЕсли;
	
	Элементы.Комментарий.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПодключитьПочтовуюСлужбу()
	
	Элементы.ПодключитьПочтовуюСлужбу.Видимость = ПравоДоступа("Добавление",
	Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакЗагружатьПочту(Знач УчетнаяЗапись, Знач ЗагружатьПочту)
	
	РегистрыСведений.ОшибкиПодключенияЭлектроннойПочтыУНФ.ОчиститьЗарегистрированныеОшибки(
	УчетнаяЗапись);
	
	РегистрыСведений.УчетныеЗаписиПользователя.УстановитьПризнакЗагружатьПочту(
	Пользователи.ТекущийПользователь(),
	УчетнаяЗапись,
	ЗагружатьПочту);
	
	Если ЗагружатьПочту Тогда
		УстановитьПризнакИспользоватьДляПолучения(УчетнаяЗапись);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакИспользоватьДляПолучения(Знач УчетнаяЗапись)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УчетнаяЗаписьОбъект = УчетнаяЗапись.ПолучитьОбъект();
	УчетнаяЗаписьОбъект.ИспользоватьДляПолучения = Истина;
	УчетнаяЗаписьОбъект.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОсновнуюУчетнуюЗапись(УчетнаяЗапись)
	
	УправлениеНебольшойФирмойСервер.УстановитьНастройкуПользователя(
	УчетнаяЗапись, 
	"ОсновнаяУчетнаяЗаписьЭлектроннойПочты",
	Пользователи.ТекущийПользователь());
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ИспользоватьДляОтправки") Тогда
		УчетнаяЗаписьОбъект = УчетнаяЗапись.ПолучитьОбъект();
		УчетнаяЗаписьОбъект.ИспользоватьДляОтправки = Истина;
		УчетнаяЗаписьОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьАвторизацию()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатЗапросаТокена", ЭтотОбъект);
	ОткрытьФорму(
	"РегистрСведений.СеансовыеДанныеGoogle.Форма.ЗапросТокена",
	Новый Структура("ОписанияОбластейДоступа", ОбменСGoogleКлиентСервер.ОписанияОбластейДоступаПочта()),
	ЭтаФорма,,,,
	ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗапросаТокена(Результат, Параметры) Экспорт
	
	СеансовыеДанные = Результат;
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗапись = ДобавитьУчетнуюЗаписьGoogleНаСервере(СеансовыеДанные);
	
	Оповестить(
	ЭлектроннаяПочтаУНФКлиентСервер.ИмяСобытияУчетнаяЗаписьОбновлена(),
	УчетнаяЗапись,
	ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьУчетнуюЗаписьGoogleНаСервере(СеансовыеДанные)
	
	Результат = ОбменСGoogle.СоздатьУчетнуюЗаписьGoogle(СеансовыеДанные);
	
	РегистрыСведений.СеансовыеДанныеGoogle.ПроверитьИЗаписатьСеансовыеДанные(
	СеансовыеДанные,
	Пользователи.ТекущийПользователь(),
	Перечисления.ОбластиДоступаGoogle.Почта,
	Результат);
	
	ОбработатьПодключениеПочтовойСлужбыНаСервере(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьПодключениеПочтовойСлужбыНаСервере(УчетнаяЗапись)
	
	УстановитьПризнакЗагружатьПочту(УчетнаяЗапись, Истина);
	
	ЗаполнитьСписокУчетныхЗаписей();
	
	НайденныеСтроки = УчетныеЗаписи.НайтиСтроки(Новый Структура("УчетнаяЗапись", УчетнаяЗапись));
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Элементы.УчетныеЗаписи.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
